app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"

  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def search
    result = Skill.where('name LIKE ?', "%#{params[:term]}%").all.map do  |i|
---
SELECT "skills".* FROM "skills" WHERE (name LIKE NULL)

    def set_skill
      @skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]