app/controllers/users_controller.rb

INSERT INTO "user_skill_relationships" ("user_id", "skill_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["skill_id", 3], ["created_at", 2016-10-26 09:53:41 UTC], ["updated_at", 2016-10-26 09:53:41 UTC]]
---
  def updateSkills
    p params["skills"]
    skill_id_list = params["skills"]
    skill_id_list.each do |skill_id|
      UserSkillRelationship.new({user_id: current_user.id, skill_id: skill_id}).save